<template>
    <div class="videos py-1">
        <h1 class="videos__title text-lg font-medium mb-2">Последние видео</h1>
        <ul class="videos__list grid grid-cols-4 gap-2">
            <Card title="Кристаллы запускаются. Основные принципы"
                description="Первые минуты работы завода: камеры фиксируют, как сырьё превращается в сияющие структуры, будто завод просыпается"
                name="Кристаллический лазерный завод" raiting="4.1" views="61 тыс." date="2 нед. назад"></Card>
            <Card title="Рождение структуры"
                description="Макросъёмка: кристалл растёт слой за слоем, формируя идеальную геометрию, словно живой организм."
                name="Кристаллический лазерный завод" raiting="4.3" views="350 тыс." date="1.5 мес назад"></Card>
            <Card title="Сердце реактора. Главный механизм в выращивании кристаллов"
                description="Внутренний отсек установки: свет, тепло и химия создают магию — зритель видит ядро процесса"
                name="Кристаллический лазерный завод" raiting="4.9" views="257 тыс." date="3 мес назад"></Card>
            <Card title="Лаборатория света."
                description="Учёные настраивают спектральные лампы, чтобы изменить оттенок будущих кристаллов"
                name="Кристаллический лазерный завод" raiting="3.7" views="25 тыс." date="6 мес назад"></Card>

            <Card title="Сборочный конвейер. Доступная работа каждому"
                description="Роботы аккуратно перемещают хрупкие структуры, будто драгоценности, в защитные капсулы"
                name="Кристаллический лазерный завод" raiting="4.0" views="132 тыс." date="7 мес назад"></Card>
            <Card title="Кристаллический шторм"
                description="Камера фиксирует редкое явление: ускоренный рост, когда реактор вспыхивает сотнями мини‑кристаллов"
                name="Кристаллический лазерный завод" raiting="4.0" views="132 тыс." date="7 мес назад"></Card>
            <Card title="Геометрия идеала"
                description="Съёмка под микроскопом: идеальные грани, симметрия, отражения — будто кадры из sci‑fi."
                name="Кристаллический лазерный завод" raiting="4.0" views="57 тыс." date="9 мес назад"></Card>
            <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>
                       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>       <Card title="Транспортный отсек"
                description="Кристаллы упаковываются в контейнеры, которые выглядят как футуристические капсулы"
                name="Кристаллический лазерный завод" raiting="3.5" views="17 тыс." date="1 год назад"></Card>
            <Card title="Контроль чистоты"
                description="Специалисты проверяют каждый кристалл на дефекты, используя лазерные сканеры"
                name="Кристаллический лазерный завод" raiting="4.7" views="174 тыс." date="1.4 год назад"></Card>

        </ul>
    </div>
</template>

<script>
import Card from '../../common/player/Card.vue'

export default {
    name: "Videos",

    components: {
        Card,
    }
}
</script>
